In [15]:
import random

In [4]:
from datetime import datetime

In [6]:
current_datetime = datetime.now()

In [11]:
filename = f"{current_datetime.year}-{current_datetime.month}-{current_datetime.day}-{current_datetime.hour}-{current_datetime.minute}-{current_datetime.second}"

In [12]:
filename

'2023-11-27-17-42-59'

In [1]:
import pandas as pd

In [6]:
df = pd.read_csv('../bird_data/bird_species.csv').set_index('species_no')

In [13]:
df[-1:]

                     scientific_name species_id
species_no
10982       gallus gallus domesticus   /m/09b5t

In [3]:
!pwd

/home/user/code/brunothormaehlen/birdies/notebooks

In [11]:
df.shape

(10982, 2)

In [41]:
nomber = random.randint(1, 10982)

In [43]:
type(nomber)

int

In [62]:
df[df.index == nomber]['scientific_name'].iloc[0]

'aquila chrysaetos'

In [28]:
df

                     scientific_name   species_id
species_no
1             lithoptila abdounensis  /m/0100hjcf
2             kurrartapu johnnguyeni  /m/010hmtwz
3                    zosterops kirki  /m/011l7vvz
4                  emberiza goslingi  /m/011py2_8
5           bambolinetta lignitifila  /m/01264yxh
...                              ...          ...
10978              aquila chrysaetos     /m/0m41v
10979                        mallard    /m/01hjj1
10980                     bald eagle     /m/01dx8
10981               struthio camelus     /m/05n4y
10982       gallus gallus domesticus     /m/09b5t

[10982 rows x 2 columns]

In [48]:
df2

species_no
10978    aquila chrysaetos
Name: scientific_name, dtype: object

In [70]:
random.uniform(0.5, 1)

0.8839537716045656

In [74]:
from datetime import datetime

In [78]:
now = datetime.now()

In [79]:
now

datetime.datetime(2023, 11, 28, 12, 12, 11, 70638)

In [83]:
now.strftime("%Y-%m-%d_%H-%M-%S")

'2023-11-28_12-12-11'

In [84]:
df

                     scientific_name   species_id
species_no
1             lithoptila abdounensis  /m/0100hjcf
2             kurrartapu johnnguyeni  /m/010hmtwz
3                    zosterops kirki  /m/011l7vvz
4                  emberiza goslingi  /m/011py2_8
5           bambolinetta lignitifila  /m/01264yxh
...                              ...          ...
10978              aquila chrysaetos     /m/0m41v
10979                        mallard    /m/01hjj1
10980                     bald eagle     /m/01dx8
10981               struthio camelus     /m/05n4y
10982       gallus gallus domesticus     /m/09b5t

[10982 rows x 2 columns]

In [2]:
import pandas as pd

In [4]:
# Importing list of selected birds provided by the DATA ANALYTICS team

fp_select = '../bird_data/new_selection_raw.csv'

selected_birds_df = pd.read_csv(fp_select, delimiter=',')

columns_tbd = ['']

# Rename the second column to 'scientific_name'
selected_birds_df = selected_birds_df.rename(columns={'scientific name': 'scientific_name','id': 'species_no'})

selected_birds_df = selected_birds_df[['species_no', 'scientific_name']]

# Display the modified DataFrame
selected_birds_df

  species_no     scientific_name
0     10,848       Spinus spinus
1     10,921         Buteo buteo
2     10,883  Scolopax rusticola
3     10,828     Regulus regulus
4     10,491       Aythya nyroca
5      2,091    Corvus violaceus
6     10,512      Gavia stellata
7     10,474       Gavia arctica
8     10,588  Geronticus eremita

In [11]:
# selected_birds_df.to_csv('new_selected_birds.csv')

In [7]:
selected_birds_df.shape[0]

9

In [12]:
species_no_to_download = selected_birds_df['species_no'].tolist()

In [13]:
for i in range(len(species_no_to_download)):
    print(i)
    print(species_no_to_download[i])

0
10,848
1
10,921
2
10,883
3
10,828
4
10,491
5
2,091
6
10,512
7
10,474
8
10,588

In [14]:
len(species_no_to_download)

9